cnlohr/ch32v003fun/misc/attic/hardware_header_all_combined.h
#elif defined(CH32V20x_D8W)
    ETH_IRQn = 61,           /* ETH global Interrupt               	                 */
    ETHWakeUp_IRQn = 62,     /* ETH WakeUp Interrupt                       			 */
    BB_IRQn = 63,            /* BLE BB global Interrupt                              */
    LLE_IRQn = 64,           /* BLE LLE global Interrupt                             */
    TIM5_IRQn = 65,          /* TIM5 global Interrupt                                */
    UART4_IRQn = 66,         /* UART4 global Interrupt                               */
    DMA1_Channel8_IRQn = 67, /* DMA1 Channel 8 global Interrupt                      */
    OSC32KCal_IRQn = 68,     /* OSC32K global Interrupt                              */
    OSCWakeUp_IRQn = 69,     /* OSC32K WakeUp Interrupt                              */
#endif

#elif defined(CH32V30x)

#ifdef CH32V30x_D8
	TIM8_BRK_IRQn               = 59,      /* TIM8 Break Interrupt                                 */
#elif defined  (CH32V30x_D8C)
	USBWakeUp_IRQn              = 58,      /* USB Device WakeUp from suspend through EXTI Line Interrupt */
	TIM8_BRK_IRQn               = 59,      /* TIM8 Break Interrupt                                 */
#endif
	TIM8_UP_IRQn                = 60,      /* TIM8 Update Interrupt                                */
	TIM8_TRG_COM_IRQn           = 61,      /* TIM8 Trigger and Commutation Interrupt               */
	TIM8_CC_IRQn                = 62,      /* TIM8 Capture Compare Interrupt                       */
	RNG_IRQn                    = 63,      /* RNG global Interrupt                                 */
	FSMC_IRQn                   = 64,      /* FSMC global Interrupt                                */
	SDIO_IRQn                   = 65,      /* SDIO global Interrupt                                */
	TIM5_IRQn                   = 66,      /* TIM5 global Interrupt                                */
	SPI3_IRQn                   = 67,      /* SPI3 global Interrupt                                */
	UART4_IRQn                  = 68,      /* UART4 global Interrupt                               */
	UART5_IRQn                  = 69,      /* UART5 global Interrupt                               */
#endif

#if defined(CH32V30x) 
	TIM6_IRQn                   = 70,      /* TIM6 global Interrupt                                */
	TIM7_IRQn                   = 71,      /* TIM7 global Interrupt                                */
	DMA2_Channel1_IRQn          = 72,      /* DMA2 Channel 1 global Interrupt                      */
	DMA2_Channel2_IRQn          = 73,      /* DMA2 Channel 2 global Interrupt                      */
	DMA2_Channel3_IRQn          = 74,      /* DMA2 Channel 3 global Interrupt                      */
	DMA2_Channel4_IRQn          = 75,      /* DMA2 Channel 4 global Interrupt                      */
	DMA2_Channel5_IRQn          = 76,      /* DMA2 Channel 5 global Interrupt                      */
	ETH_IRQn                    = 77,      /* ETH global Interrupt               	               */
	OTG_FS_IRQn                 = 83,      /* OTGFS global Interrupt NOTE: THIS APPEAR TO BE INCORRECT                */
    USBHSWakeup_IRQn            = 84,      /* USBHS Wakeup Interrupt                               */
    USBHS_IRQn                  = 85,      /* USBHS global Interrupt                               */
    DVP_IRQn                    = 86,      /* DVP global Interrupt                                 */
	UART6_IRQn                  = 87,      /* UART6 global Interrupt                               */
	UART7_IRQn                  = 88,      /* UART7 global Interrupt                               */
	UART8_IRQn                  = 89,      /* UART8 global Interrupt                               */
	TIM9_BRK_IRQn               = 90,      /* TIM9 Break Interrupt                                 */
	TIM9_UP_IRQn                = 91,      /* TIM9 Update Interrupt                                */
	TIM9_TRG_COM_IRQn           = 92,      /* TIM9 Trigger and Commutation Interrupt               */
	TIM9_CC_IRQn                = 93,      /* TIM9 Capture Compare Interrupt                       */
	TIM10_BRK_IRQn              = 94,      /* TIM10 Break Interrupt                                */
	TIM10_UP_IRQn               = 95,      /* TIM10 Update Interrupt                               */
	TIM10_TRG_COM_IRQn          = 96,      /* TIM10 Trigger and Commutation Interrupt              */
	TIM10_CC_IRQn               = 97,      /* TIM10 Capture Compare Interrupt                      */
	DMA2_Channel6_IRQn          = 98,      /* DMA2 Channel 6 global Interrupt                      */
	DMA2_Channel7_IRQn          = 99,      /* DMA2 Channel 7 global Interrupt                      */
	DMA2_Channel8_IRQn          = 100,     /* DMA2 Channel 8 global Interrupt                      */
	DMA2_Channel9_IRQn          = 101,     /* DMA2 Channel 9 global Interrupt                      */
	DMA2_Channel10_IRQn         = 102,     /* DMA2 Channel 10 global Interrupt                     */
	DMA2_Channel11_IRQn         = 103,     /* DMA2 Channel 11 global Interrupt                     */
#endif

} IRQn_Type;


#if defined (CH32V003) 

/* memory mapped structure for SysTick */
typedef struct
{
    __IO uint32_t CTLR;
    __IO uint32_t SR;
    __IO uint32_t CNT;
    uint32_t RESERVED0;
    __IO uint32_t CMP;
    uint32_t RESERVED1;
} SysTick_Type;

#elif defined(CH32V20x) || defined(CH32V30x)

/* memory mapped structure for SysTick */
typedef struct
{
	__IO uint32_t CTLR;
	__IO uint32_t SR;
	__IO uint64_t CNT;
	__IO uint64_t CMP;
} SysTick_Type;

#elif defined(CH32X03x)

/* memory mapped structure for SysTick */
typedef struct
{
  __IO uint32_t CTLR;
  __IO uint32_t SR;
  __IO uint32_t CNTL;
  __IO uint32_t CNTH;
  __IO uint32_t CMPL;
  __IO uint32_t CMPH;
} SysTick_Type;

#elif defined(CH32V10x)

/* memory mapped structure for SysTick */
typedef struct
{
  __IO uint32_t CTLR;
  __IO uint32_t CNTL;
  __IO uint32_t CNTH;
  __IO uint32_t CMPL;
  __IO uint32_t CMPH;
} SysTick_Type;

#endif

#endif /* __ASSEMBLER__*/

#define HardFault_IRQn    EXC_IRQn

#if defined(CH32V10x) || defined(CH32V20x) || defined(CH32V30x) || defined(CH32X03x)
	#define ADC1_2_IRQn       ADC_IRQn
#endif

/* Standard Peripheral Library old definitions (maintained for legacy purpose) */
#define HSI_Value             HSI_VALUE
#define HSE_Value             HSE_VALUE
#define HSEStartUp_TimeOut    HSE_STARTUP_TIMEOUT

