cnlohr/ch32v003fun/misc/attic/hardware_header_all_combined.h
/* USBD_CNTR */
#define USBD_CTRM      (1<<15)
#define USBD_PMAOVRM   (1<<14)
#define USBD_ERRM      (1<<13)
#define USBD_WKUPM     (1<<12)
#define USBD_SUSPM     (1<<11)
#define USBD_RESETM    (1<<10)
#define USBD_SOFM      (1<<9)
#define USBD_ESOFM     (1<<8)
#define USBD_RESUME    (1<<4)
#define USBD_FSUP      (1<<3)
#define USBD_LPMODE    (1<<2)
#define USBD_PDWN      (1<<1)
#define USBD_FRES      (1<<0)

/* USBD_ISTR */
#define USBD_CTR       (1<<15)
#define USBD_PMAOVR    (1<<14)
#define USBD_ERR       (1<<13)
#define USBD_WKUP      (1<<12)
#define USBD_SUSP      (1<<11)
#define USBD_RESET     (1<<10)
#define USBD_SOF       (1<<9)
#define USBD_ESOF      (1<<8)
#define USBD_DIR       (1<<4)
#define USBD_EP_ID     (0xf)

/* USBD_FNR */
#define USBD_RXDP      (1<<15)
#define USBD_RXDM      (1<<14)
#define USBD_LCK       (1<<13)
#define USBD_LSOF      (3<<11)
#define USBD_FN        (0x7ff)

/* USBD_DADDR */
#define USBD_EF        (1<<7)
#define USBD_ADD       (0x7f)

/* USBD_EPRx */
#define USBD_CTR_RX    (1<<15)
#define USBD_DTOG_RX   (1<<14)
#define USBD_STAT_RX   (3<<12)
#define USBD_SETUP     (1<<11)
#define USBD_EPTYPE    (3<<9)
#define USBD_EPKIND    (1<<8)
#define USBD_CTR_TX    (1<<7)
#define USBD_DTOG_TX   (1<<6)
#define USBD_STAT_TX   (3<<4)
#define USBD_EA        (0xf)

/* USBD_COUNTx_RX */
#define USBD_BLSIZE    (1<<15)
#define USBD_NUM_BLOCK (0x1f<<10)
#define USBD_COUNTx_RX 0x2ff


#define USBD           ((USBD_TypeDef *) USBD_BASE)

/* USB-FS-OTG Registers, Chapter 23. */
typedef struct
{
	__IO uint8_t  BASE_CTRL;
	__IO uint8_t  UDEV_CTRL;
	__IO uint8_t  INT_EN;
	__IO uint8_t  DEV_ADDR;
	__IO uint8_t  Reserve0;
	__IO uint8_t  MIS_ST;
	__IO uint8_t  INT_FG; // "Combined" register in some situations. (ST_FG)
	__IO uint8_t  INT_ST;
	__IO uint32_t RX_LEN;
	__IO uint8_t  UEP4_1_MOD;
	__IO uint8_t  UEP2_3_MOD;
	__IO uint8_t  UEP5_6_MOD;
	__IO uint8_t  UEP7_MOD;
	__IO uint32_t UEP0_DMA;
	__IO uint32_t UEP1_DMA;
	__IO uint32_t UEP2_DMA;
	__IO uint32_t UEP3_DMA;
	__IO uint32_t UEP4_DMA;
	__IO uint32_t UEP5_DMA;
	__IO uint32_t UEP6_DMA;
	__IO uint32_t UEP7_DMA;
	__IO uint16_t UEP0_TX_LEN;
	__IO uint8_t  UEP0_TX_CTRL;
	__IO uint8_t  UEP0_RX_CTRL;
	__IO uint16_t UEP1_TX_LEN;
	__IO uint8_t  UEP1_TX_CTRL;
	__IO uint8_t  UEP1_RX_CTRL;
	__IO uint16_t UEP2_TX_LEN;
	__IO uint8_t  UEP2_TX_CTRL;
	__IO uint8_t  UEP2_RX_CTRL;
	__IO uint16_t UEP3_TX_LEN;
	__IO uint8_t  UEP3_TX_CTRL;
	__IO uint8_t  UEP3_RX_CTRL;
	__IO uint16_t UEP4_TX_LEN;
	__IO uint8_t  UEP4_TX_CTRL;
	__IO uint8_t  UEP4_RX_CTRL;
	__IO uint16_t UEP5_TX_LEN;
	__IO uint8_t  UEP5_TX_CTRL;
	__IO uint8_t  UEP5_RX_CTRL;
	__IO uint16_t UEP6_TX_LEN;
	__IO uint8_t  UEP6_TX_CTRL;
	__IO uint8_t  UEP6_RX_CTRL;
	__IO uint16_t UEP7_TX_LEN;
	__IO uint8_t  UEP7_TX_CTRL;
	__IO uint8_t  UEP7_RX_CTRL;
	__IO uint32_t Reserve1;
	__IO uint32_t OTG_CR;
	__IO uint32_t OTG_SR;
} USBOTG_FS_TypeDef;

/* R8_USB_CTRL */
#define USBOTG_UC_HOST_MODE         (1<<7)
#define USBOTG_UC_LOW_SPEED         (1<<6)
#define USBOTG_UC_DEV_PU_EN         (1<<5)
#define USBOTG_UC_SYS_CTRL          (1<<4)
#define USBOTG_UC_INT_BUSY          (1<<3)
#define USBOTG_UC_RESET_SIE         (1<<2)
#define USBOTG_UC_CLR_ALL           (1<<1)
#define USBOTG_UC_DMA_EN            (1<<0)

/* R8_USB_INT_EN */
#define USBOTG_UIE_DEV_NAK          (1<<6)
#define USBOTG_UIE_FIFO_OV          (1<<4)
#define USBOTG_UIE_HST_SOF          (1<<3)
#define USBOTG_UIE_SUSPEND          (1<<2)
#define USBOTG_UIE_TRANSFER         (1<<1)
#define USBOTG_UIE_DETECT           (1<<0)
#define USBOTG_UIE_BUS_RST          (1<<0)

/* R8_USB_DEV_AD */
#define USBOTG_UDA_GP_BIT           (1<<7)
#define USBOTG_USB_ADDR             (1<<6)

/* R8_USB_MIS_ST */
#define USBOTG_UMS_SOF_PRES         (1<<7)
#define USBOTG_UMS_SOF_ACT          (1<<6)
#define USBOTG_UMS_SIE_FREE         (1<<5)
#define USBOTG_UMS_R_FIFO_RDY       (1<<4)
#define USBOTG_UMS_BUS_RESET        (1<<3)
#define USBOTG_UMS_SUSPEND          (1<<2)
#define USBOTG_UMS_DM_LEVEL         (1<<1)
#define USBOTG_UMS_DEV_ATTACH       (1<<0)

/* R8_USB_INT_FG */
#define USBOTG_U_IS_NAK             (1<<7)
#define USBOTG_U_TOG_OK             (1<<6)
#define USBOTG_U_SIE_FREE           (1<<5)
#define USBOTG_UIF_FIFO_OV          (1<<4)
#define USBOTG_UIF_HST_SOF          (1<<3)
#define USBOTG_UIF_SUSPEND          (1<<2)
#define USBOTG_UIF_TRANSFER         (1<<1)
#define USBOTG_UIF_DETECT           (1<<0)
#define USBOTG_UIF_BUS_RST          (1<<0)

/* R8_USB_INT_ST */
#define USBOTG_UIS_IS_NAK           (1<<7)
#define USBOTG_UIS_TOG_OK           (1<<6)
#define USBOTG_UIS_TOKEN            (3<<4)
#define USBOTG_UIS_ENDP             0xf
#define USBOTG_UIS_H_RES            0xf

/* R32_USB_OTG_CR */
#define USBOTG_CR_SESS_VTH          (1<<5)
#define USBOTG_CR_VBUS_VTH          (1<<4)
#define USBOTG_CR_OTG_EN            (1<<3)
#define USBOTG_CR_IDPU              (1<<2)
#define USBOTG_CR_CHARGE_VBUS       (1<<1)
#define USBOTG_CR_DISCHAR_VBUS      (1<<0)

/* R32_USB_OTG_SR */
#define USBOTG_SR_ID_DIG            (1<<3)
#define USBOTG_SR_SESS_END          (1<<2)
#define USBOTG_SR_SESS_VLD          (1<<1)
#define USBOTG_SR_VBUS_VLD          (1<<0)

/* R8_UEPn_TX_CTRL */
#define USBOTG_UEP_T_AUTO_TOG       (1<<3)
#define USBOTG_UEP_T_TOG            (1<<2)
#define USBOTG_UEP_T_RES_MASK       (3<<0)      // bit mask of handshake response type for USB endpoint X transmittal (IN)
#define USBOTG_UEP_T_RES_ACK        (0<<1)
#define USBOTG_UEP_T_RES_NONE       (1<<0)
#define USBOTG_UEP_T_RES_NAK        (1<<1)
#define USBOTG_UEP_T_RES_STALL      (3<<0)

#define USBOTG_UEP_R_AUTO_TOG       (1<<3)      // enable automatic toggle after successful transfer completion on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle
#define USBOTG_UEP_R_TOG            (1<<2)      // expected data toggle flag of USB endpoint X receiving (OUT): 0=DATA0, 1=DATA1
#define USBOTG_UEP_R_RES_MASK       (3<<0)      // bit mask of handshake response type for USB endpoint X receiving (OUT)
#define USBOTG_UEP_R_RES_ACK        (0<<1)
#define USBOTG_UEP_R_RES_NONE       (1<<0)
#define USBOTG_UEP_R_RES_NAK        (1<<1)
#define USBOTG_UEP_R_RES_STALL      (3<<0)



/* R8_UEPn_ RX_CTRL */
#define USBOTG_UEP_R_AUTO_TOG       (1<<3)
#define USBOTG_UEP_R_TOG            (1<<2)
#define USBOTG_UEP_R_RES            (3<<0)

/* R8_UEP7_MOD */
#define USBOTG_UEP7_RX_EN           (1<<3)
#define USBOTG_UEP7_TX_EN           (1<<2)
#define USBOTG_UEP7_BUF_MOD         (1<<0)

/* R8_UEP5_6_MOD */
#define USBOTG_UEP6_RX_EN           (1<<7)
#define USBOTG_UEP6_TX_EN           (1<<6)
#define USBOTG_UEP6_BUF_MOD         (1<<4)
#define USBOTG_UEP5_RX_EN           (1<<3)
#define USBOTG_UEP5_TX_EN           (1<<2)
#define USBOTG_UEP5_BUF_MOD         (1<<0)

/* R8_UEP2_3_MOD */
#define USBOTG_UEP3_RX_EN           (1<<7)
#define USBOTG_UEP3_TX_EN           (1<<6)
#define USBOTG_UEP3_BUF_MOD         (1<<4)
#define USBOTG_UEP2_RX_EN           (1<<3)
#define USBOTG_UEP2_TX_EN           (1<<2)
#define USBOTG_UEP2_BUF_MOD         (1<<0)

/* R8_UEP4_1_MOD */
#define USBOTG_UEP1_RX_EN           (1<<7)
#define USBOTG_UEP1_TX_EN           (1<<6)
#define USBOTG_UEP1_BUF_MOD         (1<<4)
#define USBOTG_UEP4_RX_EN           (1<<3)
#define USBOTG_UEP4_TX_EN           (1<<2)
#define USBOTG_UEP4_BUF_MOD         (1<<0)

/* R8_UDEV_CTRL */
#define USBOTG_UD_PD_DIS            (1<<7)
#define USBOTG_UD_DP_PIN            (1<<5)
#define USBOTG_UD_DM_PIN            (1<<4)
#define USBOTG_UD_LOW_SPEED         (1<<2)
#define USBOTG_UD_GP_BIT            (1<<1)
#define USBOTG_UD_PORT_EN           (1<<0)


#define USBFS_UDA_GP_BIT            0x80
#define USBFS_USB_ADDR_MASK         0x7F

#define DEF_USBD_UEP0_SIZE		   64	 /* usb hs/fs device end-point 0 size */
#define UEP_SIZE 64

#define DEF_UEP_IN                  0x80
#define DEF_UEP_OUT                 0x00
#define DEF_UEP_BUSY                0x01
#define DEF_UEP_FREE                0x00

#define DEF_UEP0 0
#define DEF_UEP1 1
#define DEF_UEP2 2
#define DEF_UEP3 3
#define DEF_UEP4 4
#define DEF_UEP5 5
#define DEF_UEP6 6
#define DEF_UEP7 7
#define UNUM_EP 8

typedef struct
{
	__IO uint8_t   BASE_CTRL;
	__IO uint8_t   HOST_CTRL;
	__IO uint8_t   INT_EN;
	__IO uint8_t   DEV_ADDR;
	__IO uint8_t   Reserve0;
	__IO uint8_t   MIS_ST;
	__IO uint8_t   INT_FG;
	__IO uint8_t   INT_ST;
	__IO uint16_t  RX_LEN;
	__IO uint16_t  Reserve1;
	__IO uint8_t   Reserve2;
	__IO uint8_t   HOST_EP_MOD;
	__IO uint16_t  Reserve3;
	__IO uint32_t  Reserve4;
	__IO uint32_t  Reserve5;
	__IO uint32_t  HOST_RX_DMA;
	__IO uint32_t  HOST_TX_DMA;
	__IO uint32_t  Reserve6;
	__IO uint32_t  Reserve7;
	__IO uint32_t  Reserve8;
	__IO uint32_t  Reserve9;
	__IO uint32_t  Reserve10;
	__IO uint16_t  Reserve11;
	__IO uint16_t  HOST_SETUP;
	__IO uint8_t   HOST_EP_PID;
	__IO uint8_t   Reserve12;
	__IO uint8_t   Reserve13;
	__IO uint8_t   HOST_RX_CTRL;
	__IO uint16_t  HOST_TX_LEN;
	__IO uint8_t   HOST_TX_CTRL;
	__IO uint8_t   Reserve14;
	__IO uint32_t  Reserve15;
	__IO uint32_t  Reserve16;
	__IO uint32_t  Reserve17;
	__IO uint32_t  Reserve18;
	__IO uint32_t  Reserve19;
	__IO uint32_t  OTG_CR;
	__IO uint32_t  OTG_SR;
} USBOTG_FS_HOST_TypeDef;

/* R8_UHOST_CTRL */
#define USBOTG_UH_PD_DIS       (1<<7)
#define USBOTG_UH_DP_PIN       (1<<5)
#define USBOTG_UH_DM_PIN       (1<<4)
#define USBOTG_UH_LOW_SPEED    (1<<2)
#define USBOTG_UH_BUS_RESET    (1<<1)
#define USBOTG_UH_PORT_EN      (1<<0)

