cnlohr/ch32v003fun/misc/attic/hardware_header_all_combined.h
/* R32_UH_EP_MOD */
#define USBOTG_UH_EP_TX_EN     (1<<6)
#define USBOTG_UH_EP_TBUF_MOD  (1<<4)
#define USBOTG_UH_EP_RX_EN     (1<<3)
#define USBOTG_UH_EP_RBUF_MOD  (1<<0)

/* R16_UH_SETUP */
#define USBOTG_UH_PRE_PID_EN   (1<<10)
#define USBOTG_UH_SOF_EN       (1<<2)

/* R8_UH_EP_PID */
#define USBOTG_UH_TOKEN        (0xf<<4)
#define USBOTG_UH_ENDP         (0xf<<0)

/* R8_UH_RX_CTRL */
#define USBOTG_UH_R_AUTO_TOG   (1<<3)
#define USBOTG_UH_R_TOG        (1<<2)
#define USBOTG_UH_R_RES        (1<<0)

/* R8_UH_TX_CTRL */
#define USBOTG_UH_T_AUTO_TOG   (1<<3)
#define USBOTG_UH_T_TOG        (1<<2)
#define USBOTG_UH_T_RES        (1<<0)



#if defined(CH32V30x)
/* Ethernet MAC */
typedef struct
{
  __IO uint32_t MACCR;
  __IO uint32_t MACFFR;
  __IO uint32_t MACHTHR;
  __IO uint32_t MACHTLR;
  __IO uint32_t MACMIIAR;
  __IO uint32_t MACMIIDR;
  __IO uint32_t MACFCR;
  __IO uint32_t MACVLANTR;
       uint32_t RESERVED0[2];
  __IO uint32_t MACRWUFFR;
  __IO uint32_t MACPMTCSR;
       uint32_t RESERVED1[2];
  __IO uint32_t MACSR;
  __IO uint32_t MACIMR;
  __IO uint32_t MACA0HR;
  __IO uint32_t MACA0LR;
  __IO uint32_t MACA1HR;
  __IO uint32_t MACA1LR;
  __IO uint32_t MACA2HR;
  __IO uint32_t MACA2LR;
  __IO uint32_t MACA3HR;
  __IO uint32_t MACA3LR;
       uint32_t RESERVED2[40];
  __IO uint32_t MMCCR;
  __IO uint32_t MMCRIR;
  __IO uint32_t MMCTIR;
  __IO uint32_t MMCRIMR;
  __IO uint32_t MMCTIMR;
       uint32_t RESERVED3[14];
  __IO uint32_t MMCTGFSCCR;
  __IO uint32_t MMCTGFMSCCR;
       uint32_t RESERVED4[5];
  __IO uint32_t MMCTGFCR;
       uint32_t RESERVED5[10];
  __IO uint32_t MMCRFCECR;
  __IO uint32_t MMCRFAECR;
       uint32_t RESERVED6[10];
  __IO uint32_t MMCRGUFCR;
       uint32_t RESERVED7[334];
  __IO uint32_t PTPTSCR;
  __IO uint32_t PTPSSIR;
  __IO uint32_t PTPTSHR;
  __IO uint32_t PTPTSLR;
  __IO uint32_t PTPTSHUR;
  __IO uint32_t PTPTSLUR;
  __IO uint32_t PTPTSAR;
  __IO uint32_t PTPTTHR;
  __IO uint32_t PTPTTLR;
       uint32_t RESERVED8[567];
  __IO uint32_t DMABMR;
  __IO uint32_t DMATPDR;
  __IO uint32_t DMARPDR;
  __IO uint32_t DMARDLAR;
  __IO uint32_t DMATDLAR;
  __IO uint32_t DMASR;
  __IO uint32_t DMAOMR;
  __IO uint32_t DMAIER;
  __IO uint32_t DMAMFBOCR;
       uint32_t RESERVED9[9];
  __IO uint32_t DMACHTDR;
  __IO uint32_t DMACHRDR;
  __IO uint32_t DMACHTBAR;
  __IO uint32_t DMACHRBAR;
} ETH_TypeDef;
#endif // #if defined(CH32V30x)

#if defined(CH32V20x_D8) || defined(CH32V20x_D8W)
/* ETH10M Registers */
typedef struct
{
    __IO uint8_t reserved1;
    __IO uint8_t reserved2;
    __IO uint8_t reserved3;
    __IO uint8_t EIE;

    __IO uint8_t EIR;
    __IO uint8_t ESTAT;
    __IO uint8_t ECON2;
    __IO uint8_t ECON1;

    __IO uint16_t ETXST;
    __IO uint16_t ETXLN;

    __IO uint16_t ERXST;
    __IO uint16_t ERXLN;

    __IO uint32_t HTL;
    __IO uint32_t HTH;

    __IO uint8_t ERXFON;
    __IO uint8_t MACON1;
    __IO uint8_t MACON2;
    __IO uint8_t MABBIPG;

    __IO uint16_t EPAUS;
    __IO uint16_t MAMXFL;

    __IO uint16_t MIRD;
    __IO uint16_t reserved4;

    __IO uint8_t MIERGADR;
    __IO uint8_t MISTAT;
    __IO uint16_t MIWR;

    __IO uint32_t MAADRL;

    __IO uint16_t MAADRH;
    __IO uint16_t reserved5;
} ETH10M_TypeDef;
#endif

#if defined(CH32V20x_D8) || defined(CH32V20x_D8W)
/* OSC Registers */
typedef struct
{
    __IO uint32_t HSE_CAL_CTRL;
    __IO uint32_t Reserve0;
    __IO uint16_t Reserve1;
    __IO uint16_t LSI32K_TUNE;
    __IO uint32_t Reserve2;
    __IO uint32_t Reserve3;
    __IO uint32_t Reserve4;
    __IO uint32_t Reserve5;
    __IO uint8_t  Reserve6;
    __IO uint8_t  LSI32K_CAL_CFG;
    __IO uint16_t Reserve7;
    __IO uint16_t LSI32K_CAL_STATR;
    __IO uint8_t  LSI32K_CAL_OV_CNT;
    __IO uint8_t  LSI32K_CAL_CTRL;
} OSC_TypeDef;

#endif

#endif // #if defined(CH32V20x) || defined(CH32V30x)


#if defined(CH32X03x)
/* Touch Sensor, Mirrors Analog to Digital Converter */
typedef struct
{
	__IO uint32_t RESERVED0[3];
	__IO uint32_t CHARGE1;
	__IO uint32_t CHARGE2;
	__IO uint32_t RESERVED1[10];
	__IO uint32_t CHGOFFSET;
	__IO uint32_t RESERVED2[3];
	__IO uint32_t DR_ACT_DCG;
} TKEY_TypeDef;

/* Op amp / comparator */
typedef struct
{
	__IO uint16_t CFGR1;
	__IO uint16_t CFGR2;
	__IO uint32_t CTLR1;
	__IO uint32_t CTLR2;
	__IO uint32_t OPA_KEY;
	__IO uint32_t CMP_KEY;
	__IO uint32_t POLL_KEY;
} OPACMP_TypeDef;

/* USB Full Speed Device Mode */
typedef struct
{
	__IO uint8_t BASE_CTRL; //XXX (spelling)
	__IO uint8_t UDEV_CTRL; // or host ctlr
	__IO uint8_t INT_EN;
	__IO uint8_t DEV_ADDR;
	__IO uint8_t RESERVED0;
	__IO uint8_t MIS_ST;
	__IO uint8_t INT_FG;
	__IO uint8_t INT_ST;
	__IO uint16_t RX_LEN;
	__IO uint16_t RESERVED1;
	__IO uint8_t UEP4_1_MOD;
	__IO uint8_t UEP2_3_MOD; // Also HOST_EP_MOD
	__IO uint8_t UEP567_MOD;
	__IO uint8_t RESERVED2;

	__IO uint32_t UEP0_DMA;
	__IO uint32_t UEP1_DMA;
	__IO uint32_t UEP2_DMA; // Also HOST_RX_DMA
	__IO uint32_t UEP3_DMA; // Also HOST_TX_DMA

	//__IO uint32_t UEP0_CTRL;
	__IO uint16_t UEP0_TX_LEN;
	__IO uint16_t UEP0_CTRL_H;

	//__IO uint32_t UEP1_CTRL;
	__IO uint16_t UEP1_TX_LEN;
	__IO uint16_t UEP1_CTRL_H; // Also HOST_SETUP

	//__IO uint32_t UEP2_CTRL;
	__IO uint16_t UEP2_TX_LEN; // Also HOST_PID
	__IO uint16_t UEP2_CTRL_H; // Also HOST_RX_CTL

	//__IO uint32_t UEP3_CTRL;
	__IO uint16_t UEP3_TX_LEN; // Also HOST_TX_LEN
	__IO uint16_t UEP3_CTRL_H; // Also HOST_TX_CTL

	//__IO uint32_t UEP4_CTRL;
	__IO uint16_t UEP4_TX_LEN;
	__IO uint16_t UEP4_CTRL_H;

	__IO uint32_t RESERVED3[8];

	__IO uint32_t UEP5_DMA;
	__IO uint32_t UEP6_DMA;
	__IO uint32_t UEP7_DMA;

	__IO uint32_t RESERVED4;

	//__IO uint32_t UEP5_CTRL;
	__IO uint16_t UEP5_TX_LEN;
	__IO uint16_t UEP5_CTRL_H;

	//__IO uint32_t UEP6_CTRL;
	__IO uint16_t UEP6_TX_LEN;
	__IO uint16_t UEP6_CTRL_H;

	//__IO uint32_t UEP7_CTRL;
	__IO uint16_t UEP7_TX_LEN;
	__IO uint16_t UEP7_CTRL_H;

	__IO uint32_t UEPX_MOD;
} USBFS_TypeDef;





#define USBFSD_UEP_MOD_BASE         0x4002340C
#define USBFSD_UEP_DMA_BASE         0x40023410
#define USBFSD_UEP_LEN_BASE         0x40023420
#define USBFSD_UEP_CTL_BASE         0x40023422
#define USBFSD_UEP_RX_EN            0x08
#define USBFSD_UEP_TX_EN            0x04
#define USBFSD_UEP_BUF_MOD          0x01
#define USBFSD_UEP_MOD( N )         (*((volatile uint8_t *)( USBFSD_UEP_MOD_BASE + N )))
#define USBFSD_UEP_TX_CTRL( N )     (*((volatile uint8_t *)( USBFSD_UEP_CTL_BASE + N * 0x04 )))
#define USBFSD_UEP_RX_CTRL( N )     (*((volatile uint8_t *)( USBFSD_UEP_CTL_BASE + N * 0x04 )))
#define USBFSD_UEP_DMA( N )         (*((volatile uint32_t *)( USBFSD_UEP_DMA_BASE + N * 0x04 )))
#define USBFSD_UEP_BUF( N )         ((uint8_t *)(*((volatile uint32_t *)( USBFSD_UEP_DMA_BASE + N * 0x04 ))) + 0x20000000)
#define USBFSD_UEP_TLEN( N )        (*((volatile uint16_t *)( USBFSD_UEP_LEN_BASE + N * 0x04 )))

