cnlohr/ch32v003fun/misc/attic/hardware_header_all_combined.h
/* R8_UEPn_TX_CTRL */
#define USBFS_UEP_T_AUTO_TOG        (1<<4)      // enable automatic toggle after successful transfer completion on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle
#define USBFS_UEP_T_TOG             (1<<6)      // prepared data toggle flag of USB endpoint X transmittal (IN): 0=DATA0, 1=DATA1
#define USBFS_UEP_T_RES_MASK        (3<<0)      // bit mask of handshake response type for USB endpoint X transmittal (IN)
#define USBFS_UEP_T_RES_ACK         (0<<1)
#define USBFS_UEP_T_RES_NONE        (1<<0)
#define USBFS_UEP_T_RES_NAK         (1<<1)
#define USBFS_UEP_T_RES_STALL       (3<<0)
// bUEP_T_RES1 & bUEP_T_RES0: handshake response type for USB endpoint X transmittal (IN)
//   00: DATA0 or DATA1 then expecting ACK (ready)
//   01: DATA0 or DATA1 then expecting no response, time out from host, for non-zero endpoint isochronous transactions
//   10: NAK (busy)
//   11: STALL (error)
// host aux setup

/* R8_UEPn_RX_CTRL, n=0-7 */
#define USBFS_UEP_R_AUTO_TOG        (1<<4)      // enable automatic toggle after successful transfer completion on endpoint 1/2/3: 0=manual toggle, 1=automatic toggle
#define USBFS_UEP_R_TOG             (1<<7)      // expected data toggle flag of USB endpoint X receiving (OUT): 0=DATA0, 1=DATA1
#define USBFS_UEP_R_RES_MASK        (3<<2)      // bit mask of handshake response type for USB endpoint X receiving (OUT)
#define USBFS_UEP_R_RES_ACK         (0<<3)
#define USBFS_UEP_R_RES_NONE        (1<<2)
#define USBFS_UEP_R_RES_NAK         (1<<3)
#define USBFS_UEP_R_RES_STALL       (3<<2)


#define EP1_T_EN					(1<<6)
#define EP2_T_EN					(1<<2)
#define EP3_T_EN					(1<<6)
#define EP4_T_EN					(1<<2)
#define EP1_R_EN					(1<<7)
#define EP2_R_EN					(1<<3)
#define EP3_R_EN					(1<<7)
#define EP4_R_EN					(1<<3)


/* R8_USB_CTRL */
#define USBFS_UC_HOST_MODE          0x80
#define USBFS_UC_LOW_SPEED          0x40
#define USBFS_UC_DEV_PU_EN          0x20
#define USBFS_UC_SYS_CTRL_MASK      0x30
#define USBFS_UC_SYS_CTRL0          0x00
#define USBFS_UC_SYS_CTRL1          0x10
#define USBFS_UC_SYS_CTRL2          0x20
#define USBFS_UC_SYS_CTRL3          0x30
#define USBFS_UC_INT_BUSY           0x08
#define USBFS_UC_RESET_SIE          0x04
#define USBFS_UC_CLR_ALL            0x02
#define USBFS_UC_DMA_EN             0x01

/* R8_USB_INT_EN */
#define USBFS_UIE_DEV_SOF           0x80
#define USBFS_UIE_DEV_NAK           0x40
#define USBFS_UIE_FIFO_OV           0x10
#define USBFS_UIE_HST_SOF           0x08
#define USBFS_UIE_SUSPEND           0x04
#define USBFS_UIE_TRANSFER          0x02
#define USBFS_UIE_DETECT            0x01
#define USBFS_UIE_BUS_RST           0x01

/* R8_USB_DEV_AD */
#define USBFS_UDA_GP_BIT            0x80
#define USBFS_USB_ADDR_MASK         0x7F

/* R8_USB_MIS_ST */
#define USBFS_UMS_SOF_PRES          0x80
#define USBFS_UMS_SOF_ACT           0x40
#define USBFS_UMS_SIE_FREE          0x20
#define USBFS_UMS_R_FIFO_RDY        0x10
#define USBFS_UMS_BUS_RESET         0x08
#define USBFS_UMS_SUSPEND           0x04
#define USBFS_UMS_DM_LEVEL          0x02
#define USBFS_UMS_DEV_ATTACH        0x01




#define USBFS_UDA_GP_BIT            0x80
#define USBFS_USB_ADDR_MASK         0x7F

#define DEF_USBD_UEP0_SIZE		   64	 /* usb hs/fs device end-point 0 size */
#define UEP_SIZE 64

#define DEF_UEP_IN                  0x80
#define DEF_UEP_OUT                 0x00
#define DEF_UEP_BUSY                0x01
#define DEF_UEP_FREE                0x00

#define DEF_UEP0 0
#define DEF_UEP1 1
#define DEF_UEP2 2
#define DEF_UEP3 3
#define DEF_UEP4 4
#define DEF_UEP5 5
#define DEF_UEP6 6
#define DEF_UEP7 7
#define UNUM_EP 8



/* USB Host Mode */

typedef struct
{
	__IO uint8_t RESERVED0;
	__IO uint8_t HOST_CTRL;
	__IO uint8_t RESERVED1;
	__IO uint8_t RESERVED2;
	__IO uint8_t RESERVED3;
	__IO uint8_t RESERVED4;
	__IO uint8_t RESERVED5;
	__IO uint8_t RESERVED6;
	__IO uint16_t RESERVED7;
	__IO uint16_t RESERVED8;
	__IO uint8_t RESERVED9;
	__IO uint8_t HOST_EP_MOD;
	__IO uint8_t RESERVED10;
	__IO uint8_t RESERVED11;

	__IO uint32_t RESERVED12;
	__IO uint32_t RESERVED13;
	__IO uint32_t HOST_RX_DMA;
	__IO uint32_t HOST_TX_DMA;

	__IO uint16_t RESERVED14;
	__IO uint16_t RESERVED15;
	__IO uint16_t RESERVED16;

	__IO uint16_t HOST_SETUP;
	__IO uint16_t HOST_EP_PID;
	__IO uint16_t HOST_RX_CTL;
	__IO uint16_t HOST_TX_LEN;
	__IO uint16_t HOST_TX_CTL;

	__IO uint16_t RESERVED20;
	__IO uint16_t RESERVED21;

	__IO uint32_t RESERVED22[8];

	__IO uint32_t RESERVED23;
	__IO uint32_t RESERVED24;
	__IO uint32_t RESERVED25;

	__IO uint32_t RESERVED26;

	__IO uint16_t RESERVED27;
	__IO uint16_t RESERVED28;

	__IO uint16_t RESERVED29;
	__IO uint16_t RESERVED30;

	__IO uint16_t RESERVED31;
	__IO uint16_t RESERVED32;

	__IO uint32_t RESERVED33;
} USBDH_TypeDef;


/* USB Power Delivery */
typedef struct
{
	__IO uint32_t CONFIG;
	__IO uint32_t CONTROL;
	__IO uint32_t STATUS;
	__IO uint32_t PORT;
	__IO uint32_t DMA;
} USBPD_TypeDef;


/* USB Power Delivery */
typedef struct
{
	__IO uint16_t CONFIG;
	__IO uint16_t BCM_CLK_CNT;

	__IO uint8_t CONTROL;
	__IO uint8_t TX_SEL;
	__IO uint16_t BMC_TX_SZ;

	__IO uint8_t DATA_BUF;
	__IO uint8_t STATUS;
	__IO uint16_t BMC_BYTE_CNT;

	__IO uint16_t PORT_CC1;
	__IO uint16_t PORT_CC2;

	__IO uint32_t USBPD_DMA;
} USBPD_DETAILED_TypeDef;

#endif // #if defined(CH32X03x)


#endif

/* Peripheral memory map */
#ifdef __ASSEMBLER__
#define FLASH_BASE                              (0x08000000) /* FLASH base address in the alias region */
#define SRAM_BASE                               (0x20000000) /* SRAM base address in the alias region */
#define PERIPH_BASE                             (0x40000000) /* Peripheral base address in the alias region */
#define CORE_PERIPH_BASE                        (0xE0000000) /* System peripherals base address in the alias region */
#else
#define FLASH_BASE                              ((uint32_t)0x08000000) /* FLASH base address in the alias region */
#define SRAM_BASE                               ((uint32_t)0x20000000) /* SRAM base address in the alias region */
#define PERIPH_BASE                             ((uint32_t)0x40000000) /* Peripheral base address in the alias region */
#define CORE_PERIPH_BASE                        ((uint32_t)0xE0000000) /* System peripherals base address in the alias region */
#endif

#if defined(CH32V30x)
#ifdef __ASSEMBLER__
#define FSMC_R_BASE           					(b 0xA0000000) /* FSMC registers base address */
#else
#define FSMC_R_BASE           					((uint32_t)0xA0000000) /* FSMC registers base address */
#endif
#endif

#define APB1PERIPH_BASE                         (PERIPH_BASE)
#define APB2PERIPH_BASE                         (PERIPH_BASE + 0x10000)
#define AHBPERIPH_BASE                          (PERIPH_BASE + 0x20000)

#define TIM2_BASE                               (APB1PERIPH_BASE + 0x0000)
#if defined(CH32V10x) || defined(CH32V20x) || defined(CH32V30x) || defined(CH32X03x)
#define TIM3_BASE                               (APB1PERIPH_BASE + 0x0400)
#if defined(CH32V10x) || defined(CH32V20x) || defined(CH32V30x)
#define TIM4_BASE                               (APB1PERIPH_BASE + 0x0800)
#define TIM5_BASE                               (APB1PERIPH_BASE + 0x0C00)
#endif // CH32V10x, CH32V20x, CH32V30x
#if defined(CH32V30x)	// CH32V30x
#define TIM6_BASE             					(APB1PERIPH_BASE + 0x1000)
#define TIM7_BASE             					(APB1PERIPH_BASE + 0x1400)
#define UART6_BASE            					(APB1PERIPH_BASE + 0x1800)
#define UART7_BASE            					(APB1PERIPH_BASE + 0x1C00)
#define UART8_BASE            					(APB1PERIPH_BASE + 0x2000)
#endif					// CH32V30x
#if defined(CH32V10x)	// CH32V10x
#define TIM6_BASE                               (APB1PERIPH_BASE + 0x1000)
#define TIM7_BASE                               (APB1PERIPH_BASE + 0x1400)
#define TIM12_BASE                              (APB1PERIPH_BASE + 0x1800)
#define TIM13_BASE                              (APB1PERIPH_BASE + 0x1C00)
#define TIM14_BASE                              (APB1PERIPH_BASE + 0x2000)
#endif					// CH32V10x
#if defined(CH32V003) || defined(CH32V10x) || defined(CH32V20x) || defined(CH32V30x)
#define RTC_BASE                                (APB1PERIPH_BASE + 0x2800)
#endif
#endif
#define WWDG_BASE                               (APB1PERIPH_BASE + 0x2C00)
#define IWDG_BASE                               (APB1PERIPH_BASE + 0x3000)
#if defined(CH32V10x) || defined(CH32V20x) || defined(CH32V30x)
#define SPI2_BASE                               (APB1PERIPH_BASE + 0x3800)
#if defined(CH32V10x) || defined(CH32V30x)
#define SPI3_BASE             					(APB1PERIPH_BASE + 0x3C00)
#endif // defined(CH32V30x) || defined(CH32V10x)
#endif
#if defined(CH32V10x) || defined(CH32V20x) || defined(CH32V30x) || defined(CH32X03x)
#define USART2_BASE                             (APB1PERIPH_BASE + 0x4400)
#define USART3_BASE                             (APB1PERIPH_BASE + 0x4800)
#define UART4_BASE                              (APB1PERIPH_BASE + 0x4C00)
#if defined(CH32V10x) || defined(CH32V30x)
#define UART5_BASE            					(APB1PERIPH_BASE + 0x5000)
#endif // defined(CH32V30x) || defined(CH32V10x)
#endif // defined(CH32V10x) || defined(CH32V20x) || defined(CH32V30x)
#define I2C1_BASE                               (APB1PERIPH_BASE + 0x5400)
#if defined(CH32V10x) || defined(CH32V20x) || defined(CH32V30x)
#define I2C2_BASE                               (APB1PERIPH_BASE + 0x5800)
#endif
#if defined(CH32V20x) || defined(CH32V30x)
#define CAN1_BASE                               (APB1PERIPH_BASE + 0x6400)
#endif
#if defined(CH32V30x)
#define CAN2_BASE             (APB1PERIPH_BASE + 0x6800)
#endif
#if defined(CH32V10x) || defined(CH32V20x) || defined(CH32V30x)
#define BKP_BASE                                (APB1PERIPH_BASE + 0x6C00)
#endif
#define PWR_BASE                                (APB1PERIPH_BASE + 0x7000)
#if defined(CH32V10x) || defined(CH32V30x)
#define DAC_BASE              					(APB1PERIPH_BASE + 0x7400)
#endif

#define AFIO_BASE                               (APB2PERIPH_BASE + 0x0000)
#define EXTI_BASE                               (APB2PERIPH_BASE + 0x0400)
#define GPIOA_BASE                              (APB2PERIPH_BASE + 0x0800)
#if defined(CH32V10x) || defined(CH32V20x) || defined(CH32V30x) || defined(CH32X03x)
#define GPIOB_BASE                              (APB2PERIPH_BASE + 0x0C00)
#endif
#define GPIOC_BASE                              (APB2PERIPH_BASE + 0x1000)
#define GPIOD_BASE                              (APB2PERIPH_BASE + 0x1400)
#if defined(CH32V10x) || defined(CH32V20x) || defined(CH32V30x)
#define GPIOE_BASE                              (APB2PERIPH_BASE + 0x1800)
#define GPIOF_BASE                              (APB2PERIPH_BASE + 0x1C00)
#define GPIOG_BASE                              (APB2PERIPH_BASE + 0x2000)
#endif
#define ADC1_BASE                               (APB2PERIPH_BASE + 0x2400)
#if defined(CH32V10x) || defined(CH32V20x) || defined(CH32V30x)
#define ADC2_BASE                               (APB2PERIPH_BASE + 0x2800)
#endif
#define TIM1_BASE                               (APB2PERIPH_BASE + 0x2C00)
#define SPI1_BASE                               (APB2PERIPH_BASE + 0x3000)
#if defined(CH32V10x) || defined(CH32V30x)
#define TIM8_BASE             					(APB2PERIPH_BASE + 0x3400)
#endif
#define USART1_BASE                             (APB2PERIPH_BASE + 0x3800)
#if defined(CH32V10x) || defined(CH32V30x)
#define ADC3_BASE             					(APB2PERIPH_BASE + 0x3C00)
#define TIM15_BASE            					(APB2PERIPH_BASE + 0x4000)
#define TIM16_BASE            					(APB2PERIPH_BASE + 0x4400)
#define TIM17_BASE            					(APB2PERIPH_BASE + 0x4800)
#define TIM9_BASE             					(APB2PERIPH_BASE + 0x4C00)
#define TIM10_BASE            					(APB2PERIPH_BASE + 0x5000)
#define TIM11_BASE           					(APB2PERIPH_BASE + 0x5400)
#endif
#if defined(CH32V30x)
#define SDIO_BASE            					(APB2PERIPH_BASE + 0x8000)
#endif

#define DMA1_BASE                               (AHBPERIPH_BASE + 0x0000)
#define DMA1_Channel1_BASE                      (AHBPERIPH_BASE + 0x0008)
#define DMA1_Channel2_BASE                      (AHBPERIPH_BASE + 0x001C)
#define DMA1_Channel3_BASE                      (AHBPERIPH_BASE + 0x0030)
#define DMA1_Channel4_BASE                      (AHBPERIPH_BASE + 0x0044)
#define DMA1_Channel5_BASE                      (AHBPERIPH_BASE + 0x0058)
#define DMA1_Channel6_BASE                      (AHBPERIPH_BASE + 0x006C)
#define DMA1_Channel7_BASE                      (AHBPERIPH_BASE + 0x0080)
#if defined(CH32V20x)
#define DMA1_Channel8_BASE                      (AHBPERIPH_BASE + 0x0094)
#endif
#if defined(CH32V10x) || defined(CH32V30x)
#define DMA2_BASE             					(AHBPERIPH_BASE + 0x0400)
#define DMA2_Channel1_BASE    					(AHBPERIPH_BASE + 0x0408)
#define DMA2_Channel2_BASE    					(AHBPERIPH_BASE + 0x041C)
#define DMA2_Channel3_BASE    					(AHBPERIPH_BASE + 0x0430)
#define DMA2_Channel4_BASE    					(AHBPERIPH_BASE + 0x0444)
#define DMA2_Channel5_BASE    					(AHBPERIPH_BASE + 0x0458)
#if defined(CH32V30x)
#define DMA2_Channel6_BASE    					(AHBPERIPH_BASE + 0x046C)
#define DMA2_Channel7_BASE    					(AHBPERIPH_BASE + 0x0480)
#define DMA2_Channel8_BASE    					(AHBPERIPH_BASE + 0x0490)
#define DMA2_Channel9_BASE    					(AHBPERIPH_BASE + 0x04A0)
#define DMA2_Channel10_BASE   					(AHBPERIPH_BASE + 0x04B0)
#define DMA2_Channel11_BASE   					(AHBPERIPH_BASE + 0x04C0)
#define DMA2_EXTEN_BASE       					(AHBPERIPH_BASE + 0x04D0)
#endif // defined(CH32V30x)
#endif
#define RCC_BASE                                (AHBPERIPH_BASE + 0x1000)

#define FLASH_R_BASE                            (AHBPERIPH_BASE + 0x2000) /* Flash registers base address */

#if defined(CH32V20x)
#define CRC_BASE                                (AHBPERIPH_BASE + 0x3000)
#define OPA_BASE                                (AHBPERIPH_BASE + 0x3804)
#define ETH10M_BASE                             (AHBPERIPH_BASE + 0x8000)

#define USBFS_BASE                              ((uint32_t)0x50000000)
#elif defined(CH32X03x)

#define OPA_BASE                                (AHBPERIPH_BASE + 0x6000)
#define USBFS_BASE                              (AHBPERIPH_BASE + 0x3400)
#define USBPD_BASE                              (AHBPERIPH_BASE + 0x7000)

#elif defined(CH32V30x)
#define CRC_BASE              					(AHBPERIPH_BASE + 0x3000)
#define USBHS_BASE            					(AHBPERIPH_BASE + 0x3400)
#define OPA_BASE              					(AHBPERIPH_BASE + 0x3804)
#define RNG_BASE              					(AHBPERIPH_BASE + 0x3C00)

#define ETH_BASE              					(AHBPERIPH_BASE + 0x8000)
#define ETH_MAC_BASE          					(ETH_BASE)
#define ETH_MMC_BASE          					(ETH_BASE + 0x0100)
#define ETH_PTP_BASE          					(ETH_BASE + 0x0700)
#define ETH_DMA_BASE          					(ETH_BASE + 0x1000)

#define USBFS_BASE            					((uint32_t)0x50000000)
#define DVP_BASE              					((uint32_t)0x50050000)

