cnlohr/ch32v003fun/misc/attic/hardware_header_all_combined.h
#define FSMC_Bank1_R_BASE     					(FSMC_R_BASE + 0x0000)
#define FSMC_Bank1E_R_BASE    					(FSMC_R_BASE + 0x0104)
#define FSMC_Bank2_R_BASE     					(FSMC_R_BASE + 0x0060)
#elif defined(CH32V10x)
#define CRC_BASE                                (AHBPERIPH_BASE + 0x3000)
#define DBGMCU_BASE                             ((uint32_t)0xE000D000)
#endif

#define OB_BASE                                 ((uint32_t)0x1FFFF800)    /* Flash Option Bytes base address */
#define ESIG_BASE                               ((uint32_t)0x1FFFF7E0)
#define INFO_BASE                               ((uint32_t)0x1FFFF704)

#define EXTEN_BASE                              (AHBPERIPH_BASE + 0x3800)

#define PFIC_BASE    (CORE_PERIPH_BASE + 0xE000)
#define SysTick_BASE    (CORE_PERIPH_BASE + 0xF000)

#if defined(CH32V20x)
#if defined(CH32V20x_D8) || defined(CH32V20x_D8W)
#define OSC_BASE                                (AHBPERIPH_BASE + 0x202C)
#endif
#endif






/* Peripheral declaration */
#define TIM2                                    ((TIM_TypeDef *)TIM2_BASE)
#if defined(CH32V10x) || defined(CH32V20x) || defined(CH32V30x)
#define TIM3                                    ((TIM_TypeDef *)TIM3_BASE)
#define TIM4                                    ((TIM_TypeDef *)TIM4_BASE)
#define TIM5                                    ((TIM_TypeDef *)TIM5_BASE)
#if defined(CH32V30x)
#define TIM6                					((TIM_TypeDef *) TIM6_BASE)
#define TIM7                					((TIM_TypeDef *) TIM7_BASE)
#define UART6               					((USART_TypeDef *) UART6_BASE)
#define UART7               					((USART_TypeDef *) UART7_BASE)
#define UART8               					((USART_TypeDef *) UART8_BASE)
#endif // defined(CH32V30x)
#if defined(CH32V10x)
#define TIM6                                    ((TIM_TypeDef *)TIM6_BASE)
#define TIM7                                    ((TIM_TypeDef *)TIM7_BASE)
#define TIM12                                   ((TIM_TypeDef *)TIM12_BASE)
#define TIM13                                   ((TIM_TypeDef *)TIM13_BASE)
#define TIM14                                   ((TIM_TypeDef *)TIM14_BASE)
#endif // defined(CH32V10x)
#define RTC                                     ((RTC_TypeDef *)RTC_BASE)
#endif // defined(CH32V10x) || defined(CH32V20x) || defined(CH32V30x)
#define WWDG                                    ((WWDG_TypeDef *)WWDG_BASE)
#define IWDG                                    ((IWDG_TypeDef *)IWDG_BASE)
#if defined(CH32V10x) || defined(CH32V20x) || defined(CH32V30x)
#define SPI2                                    ((SPI_TypeDef *)SPI2_BASE)
#if defined(CH32V10x) || defined(CH32V30x)
#define SPI3                					((SPI_TypeDef *) SPI3_BASE)
#endif
#endif // defined(CH32V10x) || defined(CH32V20x) || defined(CH32V30x)
#if defined(CH32V10x) || defined(CH32V20x) || defined(CH32V30x) || defined(CH32X03x)
#define USART2                                  ((USART_TypeDef *)USART2_BASE)
#define USART3                                  ((USART_TypeDef *)USART3_BASE)
#define UART4                                   ((USART_TypeDef *)UART4_BASE)
#if defined(CH32V10x) || defined(CH32V30x)
#define UART5               					((USART_TypeDef *) UART5_BASE)
#endif
#endif // defined(CH32V10x) || defined(CH32V20x) || defined(CH32V30x) || defined(CH32X03x)
#define I2C1                                    ((I2C_TypeDef *)I2C1_BASE)
#if defined(CH32V10x) || defined(CH32V20x) || defined(CH32V30x)
#define I2C2                                    ((I2C_TypeDef *)I2C2_BASE)
#endif
#if defined(CH32V20x) || defined(CH32V30x)
#define CAN1                                    ((CAN_TypeDef *)CAN1_BASE)
#endif
#if defined(CH32V30x)
#define CAN2                					((CAN_TypeDef *) CAN2_BASE)
#endif
#if defined(CH32V10x) || defined(CH32V20x) || defined(CH32V30x)
#define BKP                                     ((BKP_TypeDef *)BKP_BASE)
#endif
#define PWR                                     ((PWR_TypeDef *)PWR_BASE)
#if defined(CH32V10x) || defined(CH32V30x)
#define DAC                 					((DAC_TypeDef *) DAC_BASE)
#endif

#define AFIO                                    ((AFIO_TypeDef *)AFIO_BASE)
#define EXTI                                    ((EXTI_TypeDef *)EXTI_BASE)
#define GPIOA                                   ((GPIO_TypeDef *)GPIOA_BASE)
#if defined(CH32V10x) || defined(CH32V20x) || defined(CH32V30x) || defined(CH32X03x)
#define GPIOB                                   ((GPIO_TypeDef *)GPIOB_BASE)
#endif
#define GPIOC                                   ((GPIO_TypeDef *)GPIOC_BASE)
#define GPIOD                                   ((GPIO_TypeDef *)GPIOD_BASE)
#if defined(CH32V10x) || defined(CH32V20x) || defined(CH32V30x)
#define GPIOE                                   ((GPIO_TypeDef *)GPIOE_BASE)
#define GPIOF                                   ((GPIO_TypeDef *)GPIOF_BASE)
#define GPIOG                                   ((GPIO_TypeDef *)GPIOG_BASE)
#endif
#define ADC1                                    ((ADC_TypeDef *)ADC1_BASE)
#if defined(CH32V10x) || defined(CH32V20x) || defined(CH32V30x)
#define ADC2                                    ((ADC_TypeDef *)ADC2_BASE)
#endif
#ifdef CH32X03x
#define TIM3                                    ((TIM_TypeDef *)TIM3_BASE)
#define TKey                                    ((TKEY_TypeDef *)ADC1_BASE)
#define OPA										((OPACMP_TypeDef *)OPA_BASE)
#define USBFS									((USBFS_TypeDef *)USBFS_BASE)
#define USBPDWORD								((USBPD_TypeDef *)USBPD_BASE)
#define USBPD									((USBPD_DETAILED_TypeDef *)USBPD_BASE)
#define USBDH									((USBDH_TypeDef *)USBFS_BASE)

#endif
#if defined(CH32V20x) || defined(CH32V30x)
#define TKey1                                   ((ADC_TypeDef *)ADC1_BASE)
#define TKey2                                   ((ADC_TypeDef *)ADC2_BASE)
#endif
#define TIM1                                    ((TIM_TypeDef *)TIM1_BASE)
#define SPI1                                    ((SPI_TypeDef *)SPI1_BASE)
#if defined(CH32V10x) || defined(CH32V30x)
#define TIM8                					((TIM_TypeDef *) TIM8_BASE)
#endif
#define USART1                                  ((USART_TypeDef *)USART1_BASE)
#if defined(CH32V10x) || defined(CH32V30x)
#define ADC3                					((ADC_TypeDef *) ADC3_BASE)
#define TIM15               					((TIM_TypeDef *) TIM15_BASE)
#define TIM16               					((TIM_TypeDef *) TIM16_BASE)
#define TIM17               					((TIM_TypeDef *) TIM17_BASE)
#define TIM9                					((TIM_TypeDef *) TIM9_BASE)
#define TIM10               					((TIM_TypeDef *) TIM10_BASE)
#define TIM11               					((TIM_TypeDef *) TIM11_BASE)
#endif // defined(CH32V10x) || defined(CH32V30x)
#if defined(CH32V30x)
#define SDIO                					((SDIO_TypeDef *) SDIO_BASE)
#endif

#define DMA1                                    ((DMA_TypeDef *)DMA1_BASE)
#define DMA1_Channel1                           ((DMA_Channel_TypeDef *)DMA1_Channel1_BASE)
#define DMA1_Channel2                           ((DMA_Channel_TypeDef *)DMA1_Channel2_BASE)
#define DMA1_Channel3                           ((DMA_Channel_TypeDef *)DMA1_Channel3_BASE)
#define DMA1_Channel4                           ((DMA_Channel_TypeDef *)DMA1_Channel4_BASE)
#define DMA1_Channel5                           ((DMA_Channel_TypeDef *)DMA1_Channel5_BASE)
#define DMA1_Channel6                           ((DMA_Channel_TypeDef *)DMA1_Channel6_BASE)
#define DMA1_Channel7                           ((DMA_Channel_TypeDef *)DMA1_Channel7_BASE)
#if defined(CH32V20x) || defined(CH32X03x)
#define DMA1_Channel8                           ((DMA_Channel_TypeDef *)DMA1_Channel8_BASE)
#endif
#if defined(CH32V10x) || defined(CH32V30x)
#define DMA2                					((DMA_TypeDef *) DMA2_BASE)
#define DMA2_EXTEN          					((DMA_TypeDef *) DMA2_EXTEN_BASE)
#define DMA2_Channel1       					((DMA_Channel_TypeDef *) DMA2_Channel1_BASE)
#define DMA2_Channel2       					((DMA_Channel_TypeDef *) DMA2_Channel2_BASE)
#define DMA2_Channel3       					((DMA_Channel_TypeDef *) DMA2_Channel3_BASE)
#define DMA2_Channel4       					((DMA_Channel_TypeDef *) DMA2_Channel4_BASE)
#define DMA2_Channel5       					((DMA_Channel_TypeDef *) DMA2_Channel5_BASE)
#if defined(CH32V30x)
#define DMA2_Channel6       					((DMA_Channel_TypeDef *) DMA2_Channel6_BASE)
#define DMA2_Channel7       					((DMA_Channel_TypeDef *) DMA2_Channel7_BASE)
#define DMA2_Channel8       					((DMA_Channel_TypeDef *) DMA2_Channel8_BASE)
#define DMA2_Channel9       					((DMA_Channel_TypeDef *) DMA2_Channel9_BASE)
#define DMA2_Channel10      					((DMA_Channel_TypeDef *) DMA2_Channel10_BASE)
#define DMA2_Channel11      					((DMA_Channel_TypeDef *) DMA2_Channel11_BASE)
#endif // defined(CH32V30x)
#endif // defined(CH32V10x) || defined(CH32V30x)
#define RCC                                     ((RCC_TypeDef *)RCC_BASE)
#define FLASH                                   ((FLASH_TypeDef *)FLASH_R_BASE)
#if defined(CH32V10x) || defined(CH32V20x) || defined(CH32V30x)
#define CRC                                     ((CRC_TypeDef *)CRC_BASE)
#endif
#if defined(CH32V20x) || defined(CH32V30x)
#if defined(CH32V30x)
#define USBHSD              					((USBHSD_TypeDef *) USBHS_BASE)
#define USBHSH              					((USBHSH_TypeDef *) USBHS_BASE)
#endif // defined(CH32V30x)
#define USBOTG_FS                               ((USBOTG_FS_TypeDef *)USBFS_BASE)
#define USBOTG_H_FS                             ((USBOTG_FS_HOST_TypeDef *)USBFS_BASE)
#define OPA                                     ((OPA_TypeDef *)OPA_BASE)
#if defined(CH32V20x)
#define ETH10M                                  ((ETH10M_TypeDef *)ETH10M_BASE)
#elif defined(CH32V30x)
#define RNG                 					((RNG_TypeDef *) RNG_BASE)
#define ETH                 					((ETH_TypeDef *) ETH_BASE)
#endif
#endif // defined(CH32V20x) || defined(CH32V30x)
#define OB                                      ((OB_TypeDef *)OB_BASE)
#define ESIG                                    ((ESG_TypeDef *)ESIG_BASE)
// Mentioned in ch32v30x_dbgmcu.c, may not work on all processors.
#define INFO                                    ((INFO_TypeDef *)INFO_BASE) 
#define EXTEN                                   ((EXTEN_TypeDef *)EXTEN_BASE)
#define EXTEND                                  ((EXTEND_TypeDef *)EXTEN_BASE)  // Alias to EXTEN

#if defined(CH32V20x)
#if defined(CH32V20x_D8) || defined(CH32V20x_D8W)
#define OSC                                     ((OSC_TypeDef *)OSC_BASE)
#endif
#endif

#if defined(CH32V30x)
#define DVP                 					((DVP_TypeDef *) DVP_BASE)

#define FSMC_Bank1          					((FSMC_Bank1_TypeDef *) FSMC_Bank1_R_BASE)
#define FSMC_Bank1E         					((FSMC_Bank1E_TypeDef *) FSMC_Bank1E_R_BASE)
#define FSMC_Bank2          					((FSMC_Bank2_TypeDef *) FSMC_Bank2_R_BASE)
#endif

