cnlohr/ch32v003fun/misc/attic/hardware_header_all_combined.h
/*******************************************************************************/
/* USBHS Related Register Macro Definition */

/* R8_USB_CTRL */
#define USBHS_UC_HOST_MODE          0x80
#define USBHS_UC_SPEED_TYPE         0x60
#define USBHS_UC_SPEED_LOW          0x40
#define USBHS_UC_SPEED_FULL         0x00
#define USBHS_UC_SPEED_HIGH         0x20
#define USBHS_UC_DEV_PU_EN          0x10
#define USBHS_UC_INT_BUSY           0x08
#define USBHS_UC_RESET_SIE          0x04
#define USBHS_UC_CLR_ALL            0x02
#define USBHS_UC_DMA_EN             0x01

/* R8_USB_INT_EN */
#define USBHS_UIE_DEV_NAK           0x80
#define USBHS_UIE_ISO_ACT           0x40
#define USBHS_UIE_SETUP_ACT         0x20
#define USBHS_UIE_FIFO_OV           0x10
#define USBHS_UIE_SOF_ACT           0x08
#define USBHS_UIE_SUSPEND           0x04
#define USBHS_UIE_TRANSFER          0x02
#define USBHS_UIE_DETECT            0x01
#define USBHS_UIE_BUS_RST           0x01

/* R16_USB_DEV_AD */
#define USBHS_MASK_USB_ADDR         0x7F

/* R16_USB_FRAME_NO */
#define USBHS_MICRO_FRAME_NUM       0xE000
#define USBHS_SOF_FRAME_NUM         0x07FF

/* R8_USB_SUSPEND */
#define USBHS_USB_LINESTATE         0x30
#define USBHS_USB_WAKEUP_ST         0x04
#define USBHS_USB_SYS_MOD           0x03

/* R8_USB_SPEED_TYPE */
#define USBHS_USB_SPEED_TYPE        0x03
#define USBHS_USB_SPEED_LOW         0x02
#define USBHS_USB_SPEED_FULL        0x00
#define USBHS_USB_SPEED_HIGH        0x01

/* R8_USB_MIS_ST */
#define USBHS_UMS_SOF_PRES          0x80
#define USBHS_UMS_SOF_ACT           0x40
#define USBHS_UMS_SIE_FREE          0x20
#define USBHS_UMS_R_FIFO_RDY        0x10
#define USBHS_UMS_BUS_RESET         0x08
#define USBHS_UMS_SUSPEND           0x04
#define USBHS_UMS_DEV_ATTACH        0x02
#define USBHS_UMS_SPLIT_CAN         0x01

/* R8_USB_INT_FG */
#define USBHS_UIF_ISO_ACT           0x40
#define USBHS_UIF_SETUP_ACT         0x20
#define USBHS_UIF_FIFO_OV           0x10
#define USBHS_UIF_HST_SOF           0x08
#define USBHS_UIF_SUSPEND           0x04
#define USBHS_UIF_TRANSFER          0x02
#define USBHS_UIF_DETECT            0x01
#define USBHS_UIF_BUS_RST           0x01

/* R8_USB_INT_ST */
#define USBHS_UIS_IS_NAK            0x80
#define USBHS_UIS_TOG_OK            0x40
#define USBHS_UIS_TOKEN_MASK        0x30
#define USBHS_UIS_TOKEN_OUT         0x00
#define USBHS_UIS_TOKEN_SOF         0x10
#define USBHS_UIS_TOKEN_IN          0x20
#define USBHS_UIS_TOKEN_SETUP       0x30
#define USBHS_UIS_ENDP_MASK         0x0F
#define USBHS_UIS_H_RES_MASK        0x0F

/* R16_USB_RX_LEN */
#define USBHS_USB_RX_LEN            0xFFFF

/* R32_UEP_CONFIG */
#define USBHS_UEP15_R_EN            0x80000000
#define USBHS_UEP14_R_EN            0x40000000
#define USBHS_UEP13_R_EN            0x20000000
#define USBHS_UEP12_R_EN            0x10000000
#define USBHS_UEP11_R_EN            0x08000000
#define USBHS_UEP10_R_EN            0x04000000
#define USBHS_UEP9_R_EN             0x02000000
#define USBHS_UEP8_R_EN             0x01000000
#define USBHS_UEP7_R_EN             0x00800000
#define USBHS_UEP6_R_EN             0x00400000
#define USBHS_UEP5_R_EN             0x00200000
#define USBHS_UEP4_R_EN             0x00100000
#define USBHS_UEP3_R_EN             0x00080000
#define USBHS_UEP2_R_EN             0x00040000
#define USBHS_UEP1_R_EN             0x00020000
#define USBHS_UEP0_R_EN             0x00010000
#define USBHS_UEP15_T_EN            0x00008000
#define USBHS_UEP14_T_EN            0x00004000
#define USBHS_UEP13_T_EN            0x00002000
#define USBHS_UEP12_T_EN            0x00001000
#define USBHS_UEP11_T_EN            0x00000800
#define USBHS_UEP10_T_EN            0x00000400
#define USBHS_UEP9_T_EN             0x00000200
#define USBHS_UEP8_T_EN             0x00000100
#define USBHS_UEP7_T_EN             0x00000080
#define USBHS_UEP6_T_EN             0x00000040
#define USBHS_UEP5_T_EN             0x00000020
#define USBHS_UEP4_T_EN             0x00000010
#define USBHS_UEP3_T_EN             0x00000008
#define USBHS_UEP2_T_EN             0x00000004
#define USBHS_UEP1_T_EN             0x00000002
#define USBHS_UEP0_T_EN             0x00000001

/* R32_UEP_TYPE */
#define USBHS_UEP15_R_TYPE          0x80000000
#define USBHS_UEP14_R_TYPE          0x40000000
#define USBHS_UEP13_R_TYPE          0x20000000
#define USBHS_UEP12_R_TYPE          0x10000000
#define USBHS_UEP11_R_TYPE          0x08000000
#define USBHS_UEP10_R_TYPE          0x04000000
#define USBHS_UEP9_R_TYPE           0x02000000
#define USBHS_UEP8_R_TYPE           0x01000000
#define USBHS_UEP7_R_TYPE           0x00800000
#define USBHS_UEP6_R_TYPE           0x00400000
#define USBHS_UEP5_R_TYPE           0x00200000
#define USBHS_UEP4_R_TYPE           0x00100000
#define USBHS_UEP3_R_TYPE           0x00080000
#define USBHS_UEP2_R_TYPE           0x00040000
#define USBHS_UEP1_R_TYPE           0x00020000
#define USBHS_UEP0_R_TYPE           0x00010000
#define USBHS_UEP15_T_TYPE          0x00008000
#define USBHS_UEP14_T_TYPE          0x00004000
#define USBHS_UEP13_T_TYPE          0x00002000
#define USBHS_UEP12_T_TYPE          0x00001000
#define USBHS_UEP11_T_TYPE          0x00000800
#define USBHS_UEP10_T_TYPE          0x00000400
#define USBHS_UEP9_T_TYPE           0x00000200
#define USBHS_UEP8_T_TYPE           0x00000100
#define USBHS_UEP7_T_TYPE           0x00000080
#define USBHS_UEP6_T_TYPE           0x00000040
#define USBHS_UEP5_T_TYPE           0x00000020
#define USBHS_UEP4_T_TYPE           0x00000010
#define USBHS_UEP3_T_TYPE           0x00000008
#define USBHS_UEP2_T_TYPE           0x00000004
#define USBHS_UEP1_T_TYPE           0x00000002
#define USBHS_UEP0_T_TYPE           0x00000001

/* R32_UEP_BUF_MOD */
#define USBHS_UEP15_ISO_BUF_MOD     0x80000000
#define USBHS_UEP14_ISO_BUF_MOD     0x40000000
#define USBHS_UEP13_ISO_BUF_MOD     0x20000000
#define USBHS_UEP12_ISO_BUF_MOD     0x10000000
#define USBHS_UEP11_ISO_BUF_MOD     0x08000000
#define USBHS_UEP10_ISO_BUF_MOD     0x04000000
#define USBHS_UEP9_ISO_BUF_MOD      0x02000000
#define USBHS_UEP8_ISO_BUF_MOD      0x01000000
#define USBHS_UEP7_ISO_BUF_MOD      0x00800000
#define USBHS_UEP6_ISO_BUF_MOD      0x00400000
#define USBHS_UEP5_ISO_BUF_MOD      0x00200000
#define USBHS_UEP4_ISO_BUF_MOD      0x00100000
#define USBHS_UEP3_ISO_BUF_MOD      0x00080000
#define USBHS_UEP2_ISO_BUF_MOD      0x00040000
#define USBHS_UEP1_ISO_BUF_MOD      0x00020000
#define USBHS_UEP0_ISO_BUF_MOD      0x00010000
#define USBHS_UEP15_BUF_MOD         0x00008000
#define USBHS_UEP14_BUF_MOD         0x00004000
#define USBHS_UEP13_BUF_MOD         0x00002000
#define USBHS_UEP12_BUF_MOD         0x00001000
#define USBHS_UEP11_BUF_MOD         0x00000800
#define USBHS_UEP10_BUF_MOD         0x00000400
#define USBHS_UEP9_BUF_MOD          0x00000200
#define USBHS_UEP8_BUF_MOD          0x00000100
#define USBHS_UEP7_BUF_MOD          0x00000080
#define USBHS_UEP6_BUF_MOD          0x00000040
#define USBHS_UEP5_BUF_MOD          0x00000020
#define USBHS_UEP4_BUF_MOD          0x00000010
#define USBHS_UEP3_BUF_MOD          0x00000008
#define USBHS_UEP2_BUF_MOD          0x00000004
#define USBHS_UEP1_BUF_MOD          0x00000002
#define USBHS_UEP0_BUF_MOD          0x00000001

/* R32_UEP0_DMA */
#define USBHS_UEP0_DMA              0x0000FFFF

/* R32_UEPn_TX_DMA, n=1-15 */
#define USBHS_UEPn_TX_DMA           0x0000FFFF

/* R32_UEPn_RX_DMA, n=1-15 */
#define USBHS_UEPn_RX_DMA           0x0000FFFF

/* R16_UEPn_MAX_LEN, n=0-15 */
#define USBHS_UEPn_MAX_LEN          0x07FF

/* R16_UEPn_T_LEN, n=0-15 */
#define USBHS_UEPn_T_LEN            0x07FF

/* R8_UEPn_TX_CTRL, n=0-15 */
#define USBHS_UEP_T_TOG_AUTO        0x20
#define USBHS_UEP_T_TOG_MASK        0x18
#define USBHS_UEP_T_TOG_DATA0       0x00
#define USBHS_UEP_T_TOG_DATA1       0x08
#define USBHS_UEP_T_TOG_DATA2       0x10
#define USBHS_UEP_T_TOG_MDATA       0x18
#define USBHS_UEP_T_RES_MASK        0x03
#define USBHS_UEP_T_RES_ACK         0x00
#define USBHS_UEP_T_RES_NYET        0x01
#define USBHS_UEP_T_RES_NAK         0x02
#define USBHS_UEP_T_RES_STALL       0x03

/* R8_UEPn_TX_CTRL, n=0-15 */
#define USBHS_UEP_R_TOG_AUTO        0x20
#define USBHS_UEP_R_TOG_MASK        0x18
#define USBHS_UEP_R_TOG_DATA0       0x00
#define USBHS_UEP_R_TOG_DATA1       0x08
#define USBHS_UEP_R_TOG_DATA2       0x10
#define USBHS_UEP_R_TOG_MDATA       0x18
#define USBHS_UEP_R_RES_MASK        0x03
#define USBHS_UEP_R_RES_ACK         0x00
#define USBHS_UEP_R_RES_NYET        0x01
#define USBHS_UEP_R_RES_NAK         0x02
#define USBHS_UEP_R_RES_STALL       0x03

/* R8_UHOST_CTRL */
#define USBHS_UH_SOF_EN             0x80
#define USBHS_UH_SOF_FREE           0x40
#define USBHS_UH_PHY_SUSPENDM       0x10
#define USBHS_UH_REMOTE_WKUP        0x08
#define USBHS_UH_TX_BUS_RESUME      0x04
#define USBHS_UH_TX_BUS_SUSPEND     0x02
#define USBHS_UH_TX_BUS_RESET       0x01

/* R32_UH_CONFIG */
#define USBHS_UH_EP_RX_EN           0x00040000
#define USBHS_UH_EP_TX_EN           0x00000008

/* R32_UH_EP_TYPE */
#define USBHS_UH_EP_RX_TYPE         0x00040000
#define USBHS_UH_EP_TX_TYPE         0x00000008

/* R32_UH_RX_DMA */
#define USBHS_UH_RX_DMA             0x0000FFFC

/* R32_UH_TX_DMA */
#define USBHS_UH_TX_DMA             0x0000FFFF

/* R16_UH_RX_MAX_LEN */
#define USBHS_UH_RX_MAX_LEN         0x07FF

/* R8_UH_EP_PID */
#define USBHS_UH_TOKEN_MASK         0xF0
#define USBHS_UH_ENDP_MASK          0x0F

/* R8_UH_RX_CTRL */
#define USBHS_UH_R_DATA_NO          0x40
#define USBHS_UH_R_TOG_AUTO         0x20
#define USBHS_UH_R_TOG_MASK         0x18
#define USBHS_UH_R_TOG_DATA0        0x00
#define USBHS_UH_R_TOG_DATA1        0x08
#define USBHS_UH_R_TOG_DATA2        0x10
#define USBHS_UH_R_TOG_MDATA        0x18
#define USBHS_UH_R_RES_NO           0x04
#define USBHS_UH_R_RES_MASK         0x03
#define USBHS_UH_R_RES_ACK          0x00
#define USBHS_UH_R_RES_NYET         0x01
#define USBHS_UH_R_RES_NAK          0x02
#define USBHS_UH_R_RES_STALL        0x03

/* R16_UH_TX_LEN */
#define USBHS_UH_TX_LEN             0x07FF

